leetcode_2442_count_number_of_distinct_integers_after_reverse_operations.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2442. Count Number of Distinct Integers After Reverse Operations</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2442. Count Number of Distinct Integers After Reverse Operations</h1>

<div id="outline-container-org98fcc78" class="outline-2">
<h2 id="org98fcc78">Understand the problem</h2>
<div class="outline-text-2" id="text-org98fcc78">
<p>
Given an array \(a\), find the number of distinct elements on \(b\) where \(b\) contains elements of \(a\) and for each \(x\) in \(a\), it also contains the number generated by reversing the digits of \(x\).
</p>
</div>

<div id="outline-container-orgc4d56df" class="outline-3">
<h3 id="orgc4d56df">Useful prompts</h3>
<div class="outline-text-3" id="text-orgc4d56df">
<ul class="org-ul">
<li><a href="can_we_use_brute_force_to_solve_the_problem.html#ID-29512D97-A54D-42F9-A8C7-C3422881933B">Can we use brute-force to solve the problem?</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0061fae" class="outline-2">
<h2 id="org0061fae">Devise a plan</h2>
<div class="outline-text-2" id="text-org0061fae">
<p>
<a href="pattern_small_constraints_could_allow_brute_force_solution.html#ID-BC81A358-FBCC-43AA-9928-E9778A107869">Pattern: Small constraints could allow a brute-force solution</a>, so generate \(b\) and return its size.  Time complexity and space are \(O(n)\).
</p>
</div>

<div id="outline-container-orgf968095" class="outline-3">
<h3 id="orgf968095">Carry out the plan</h3>
<div class="outline-text-3" id="text-orgf968095">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">countDistinctIntegers</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        seen = <span style="font-weight: bold;">set</span>(nums)
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> nums:
            seen.add(<span style="font-weight: bold;">int</span>(<span style="font-weight: bold;">str</span>(n)[::-1]))
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">len</span>(seen)
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>